* Calc
** calc
  - https://www.gnu.org/software/emacs/manual/html_node/calc/Function-Index.html
#+begin_src calc :var a=38 b=4.
  a + b
#+end_src

#+RESULTS:
: 42

** literate-calc-mode
  - https://github.com/sulami/literate-calc-mode.el
#+begin_src literate-calc :results output
  a0 = 2#11001100
  a1 = 2#11110000
  = and(a0, a1)
#+end_src

#+RESULTS:
: a0 = 2#11001100 => a0: 204
: a1 = 2#11110000 => a1: 240
: = and(a0, a1) => 192

#+begin_src literate-calc :results output
  Pi = 3.14159
  Tau = Pi *  2
= round(Pi, 2)
#+end_src

#+RESULTS:
:   Pi = 3.14159 => Pi: 3.14159
:   Tau = Pi *  2 => Tau: 6.28318
: = round(Pi, 2) => 3.14

** Math-Intensive Reports with GNU Emacs and Calc
*** Part 1
   - https://www.linuxjournal.com/article/5873
#+begin_src literate-calc :results output
  a = 3.1
  b = 4.1
  c = sqrt(a^2 + b^2)
#+end_src

#+RESULTS:
: a = 3.1 => a: 3.1
: b = 4.1 => b: 4.1
: c = sqrt(a^2 + b^2) => c: 5.14003891036

*** Part 2
   - https://www.linuxjournal.com/article/6306
**** vector
#+begin_src literate-calc :results output
  R = [3, -11, -29]
  F = [50, 60, -30]
  M = cross(R, F)
  = R*F
#+end_src

#+RESULTS:
: R = [3, -11, -29] => R: [3, -11, -29]
: F = [50, 60, -30] => F: [50, 60, -30]
: M = cross(R, F) => M: [2,070, -1,360, 730]
: = R*F => 360

**** matrix
#+begin_src literate-calc :results output
  A = [1, 2, 3, 4; 6, 5, 4, 3; 7, 12, 3, 4; 5, 6, 3, 2]
  Ainv = inv(A)
  B = trn([4, 6, 9, -2])
  C = A * B
#+end_src

#+RESULTS:
: A = [1, 2, 3, 4; 6, 5, 4, 3; 7, 12, 3, 4; 5, 6, 3, 2] => A: [[1, 2, 3, 4], [6, 5, 4, 3], [7, 12, 3, 4], [5, 6, 3, 2]]
: Ainv = inv(A) => Ainv: [[-0.285714285714, 0.714285714286, 0.166666666667, -0.833333333333], [0.0714285714286, -0.428571428571, 1.13513513514e-14, 0.5], [0.285714285714, -0.714285714286, -0.5, 1.5], [0.0714285714286, 0.571428571429, 0.333333333333, -1.16666666667]]
: B = trn([4, 6, 9, -2]) => B: [[4], [6], [9], [-2]]
: C = A * B => C: [[35], [84], [119], [79]]
